БИТУправление_медицинским_центром_демо/src/Documents/ИзменениеСоставаСтрахуемых/ИзменениеСоставаСтрахуемых.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеСоставаСтрахуемых</name>
  <registerRecords>InformationRegister.СоставыСтрахуемых</registerRecords>
  <attributes>
    <name>ВидПолиса</name>
    <type>
      <types>CatalogRef.ВидыПолисов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийИзмененияСоставаСтрахуемых</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Страхуемые</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Полис</name>
      <type>
        <types>CatalogRef.СтраховыеПолисы</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПолиса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПолиса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/СоставыСтрахуемых/СоставыСтрахуемых.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоставыСтрахуемых</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </resources>
  <resources>
    <name>Исключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидПолиса</name>
    <type>
      <types>CatalogRef.ВидыПолисов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Полис</name>
    <type>
      <types>CatalogRef.СтраховыеПолисы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыОперацийИзмененияСоставаСтрахуемых/ВидыОперацийИзмененияСоставаСтрахуемых.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийИзмененияСоставаСтрахуемых</name>
  <enumValues>
    <name>УтверждениеСписка</name>
  </enumValues>
  <enumValues>
    <name>ДобавлениеВСписок</name>
  </enumValues>
  <enumValues>
    <name>ИсключениеИзСписка</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/СтраховыеПолисы/СтраховыеПолисы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтраховыеПолисы</name>
  <owners>Catalog.Клиенты</owners>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПолиса</name>
    <type>
      <types>CatalogRef.ВидыПолисов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтраховаяКомпания</name>
    <type>
      <types>CatalogRef.умцСтраховыеКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеДействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификаторВидовПолисовРЭМД</name>
    <type>
      <types>CatalogRef.КлассификаторыМинЗдрава</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Documents/ИзменениеСоставаСтрахуемых/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИзменениеСоставаСтрахуемыхСтрахуемые.Клиент,
	               |	ИзменениеСоставаСтрахуемыхСтрахуемые.СерияПолиса,
	               |	ИзменениеСоставаСтрахуемыхСтрахуемые.НомерПолиса,
	               |	ИзменениеСоставаСтрахуемыхСтрахуемые.НомерСтроки
	               |ПОМЕСТИТЬ ВремТЧ
	               |ИЗ
	               |	Документ.ИзменениеСоставаСтрахуемых.Страхуемые КАК ИзменениеСоставаСтрахуемыхСтрахуемые
	               |ГДЕ
	               |	ИзменениеСоставаСтрахуемыхСтрахуемые.Ссылка = &Ссылка
	               |	И ИзменениеСоставаСтрахуемыхСтрахуемые.Полис = ЗНАЧЕНИЕ(Справочник.СтраховыеПолисы.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВремТЧ.НомерСтроки,
	               |	СтраховыеПолисы.Ссылка,
	               |	ВремТЧ.Клиент,
	               |	ВремТЧ.СерияПолиса,
	               |	ВремТЧ.НомерПолиса
	               |ИЗ
	               |	ВремТЧ КАК ВремТЧ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраховыеПолисы КАК СтраховыеПолисы
	               |		ПО ВремТЧ.Клиент = СтраховыеПолисы.Владелец
	               |			И (ВремТЧ.СерияПолиса ПОДОБНО СтраховыеПолисы.Серия)
	               |			И (ВремТЧ.НомерПолиса ПОДОБНО СтраховыеПолисы.Номер)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИскомаяСтроки = Страхуемые[Выборка.НомерСтроки-1];
		
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			ИскомаяСтроки.Полис = Выборка.Ссылка;		
		Иначе
			Если ВидОперации <> Перечисления.ВидыОперацийИзмененияСоставаСтрахуемых.ИсключениеИзСписка Тогда
				
				НовыйПолис = Справочники.СтраховыеПолисы.СоздатьЭлемент();
				НовыйПолис.Владелец = Выборка.Клиент;
				НовыйПолис.ВидПолиса = ВидПолиса;
				НовыйПолис.Контрагент = ВидПолиса.Контрагент;
				НовыйПолис.Номер = Выборка.НомерПолиса;
				НовыйПолис.Серия = Выборка.СерияПолиса;
				НовыйПолис.Записать();
				
				ИскомаяСтроки.Полис = НовыйПолис.Ссылка;
				
				Если НЕ ЗначениеЗаполнено(Выборка.Клиент.умцОсновнойСтраховойПолис) Тогда
					ОбъектКлиент = Выборка.Клиент.ПолучитьОбъект();
					ОбъектКлиент.умцОсновнойСтраховойПолис = НовыйПолис.Ссылка;
					ОбъектКлиент.Записать();
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Записать(РежимЗаписиДокумента.Запись);
	
	// Регистр СоставыСтрахуемых
	Движения.СоставыСтрахуемых.Записывать = Истина;
	Для Каждого ТекСтрокаСтрахуемые Из Страхуемые Цикл
		Если ЗначениеЗаполнено(ТекСтрокаСтрахуемые.Полис) Тогда
			Движение = Движения.СоставыСтрахуемых.Добавить();
			Движение.Период = Дата;
			Движение.ВидПолиса = ТекСтрокаСтрахуемые.Полис.ВидПолиса;
			Движение.Полис = ТекСтрокаСтрахуемые.Полис;
			Движение.Клиент = ТекСтрокаСтрахуемые.Клиент;
			Движение.Исключен = ВидОперации = Перечисления.ВидыОперацийИзмененияСоставаСтрахуемых.ИсключениеИзСписка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
